- description: "simple single statement"
  input: "SELECT 1;"
  result:
    - text: "SELECT 1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 10}
      range: {start: 0, end: 9}
      empty: false

- description: "multi-line statement"
  input: "SELECT\n  1;"
  result:
    - text: "SELECT\n  1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 2, column: 5}
      range: {start: 0, end: 11}
      empty: false

- description: "multiple statements"
  input: "SELECT 1;\nSELECT 2;"
  result:
    - text: "SELECT 1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 10}
      range: {start: 0, end: 9}
      empty: false
    - text: "SELECT 2;"
      baseline: 1
      start: {line: 2, column: 1}
      end: {line: 2, column: 10}
      range: {start: 10, end: 19}
      empty: false

- description: "multi-byte characters - Chinese"
  input: "SELECT 'ä¸­æ–‡';"
  result:
    - text: "SELECT 'ä¸­æ–‡';"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 13}
      range: {start: 0, end: 16}
      empty: false

- description: "multi-byte characters - emoji"
  input: "SELECT 'ðŸŽ‰';"
  result:
    - text: "SELECT 'ðŸŽ‰';"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 12}
      range: {start: 0, end: 14}
      empty: false

- description: "multi-byte on second line"
  input: "SELECT\n  'ä¸­æ–‡';"
  result:
    - text: "SELECT\n  'ä¸­æ–‡';"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 2, column: 8}
      range: {start: 0, end: 18}
      empty: false

- description: "multiple statements with multi-byte"
  input: "SELECT 'ä¸­';\nSELECT 'æ–‡';"
  result:
    - text: "SELECT 'ä¸­';"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 12}
      range: {start: 0, end: 13}
      empty: false
    - text: "SELECT 'æ–‡';"
      baseline: 1
      start: {line: 2, column: 1}
      end: {line: 2, column: 12}
      range: {start: 14, end: 27}
      empty: false

- description: "statement with leading spaces and multi-byte"
  input: "  SELECT 'ä¸­';"
  result:
    - text: "SELECT 'ä¸­';"
      baseline: 0
      start: {line: 1, column: 3}
      end: {line: 1, column: 14}
      range: {start: 2, end: 15}
      empty: false
