- description: multiple SELECT statements
  input: SELECT * FROM t1; SELECT * FROM t2
  result:
    - text: SELECT * FROM t1
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 1
        column: 17
      range:
        start: 0
        end: 16
      empty: false
    - text: " SELECT * FROM t2"
      baseline: 0
      start:
        line: 1
        column: 17
      end:
        line: 1
        column: 35
      range:
        start: 16
        end: 33
      empty: false
- description: multiple statements with newlines
  input: "\n\t\t\t\tselect * from t;\n\t\t\t\tcreate table table$1 (id int)\n\t\t\t"
  result:
    - text: "\n\t\t\t\tselect * from t"
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 2
        column: 20
      range:
        start: 0
        end: 20
      empty: false
    - text: "\n\t\t\t\tcreate table table$1 (id int)"
      baseline: 1
      start:
        line: 2
        column: 20
      end:
        line: 3
        column: 34
      range:
        start: 20
        end: 54
      empty: false
- description: procedure with forward slash separator
  input: |-
    CREATE OR REPLACE PROCEDURE test_proc IS
    BEGIN
        CALL DBMS_OUTPUT.PUT_LINE('Hello');
    END;
    /
  result:
    - text: |-
        CREATE OR REPLACE PROCEDURE test_proc IS
        BEGIN
            CALL DBMS_OUTPUT.PUT_LINE('Hello');
        END;
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 4
        column: 5
      range:
        start: 0
        end: 91
      empty: false
- description: two procedures with forward slash separator
  input: |-
    CREATE OR REPLACE PROCEDURE proc1 IS
    BEGIN
        NULL;
    END;
    /
    CREATE OR REPLACE PROCEDURE proc2 IS
    BEGIN
        NULL;
    END;
    /
  result:
    - text: |-
        CREATE OR REPLACE PROCEDURE proc1 IS
        BEGIN
            NULL;
        END;
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 4
        column: 5
      range:
        start: 0
        end: 57
      empty: false
    - text: "\nCREATE OR REPLACE PROCEDURE proc2 IS\nBEGIN\n    NULL;\nEND;"
      baseline: 4
      start:
        line: 5
        column: 2
      end:
        line: 9
        column: 5
      range:
        start: 59
        end: 117
      empty: false
- description: SELECT statements separated by forward slash
  input: |-
    SELECT * FROM t1;
    /
    SELECT * FROM t2;
  result:
    - text: SELECT * FROM t1
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 1
        column: 17
      range:
        start: 0
        end: 16
      empty: false
    - text: "\nSELECT * FROM t2"
      baseline: 1
      start:
        line: 2
        column: 1
      end:
        line: 3
        column: 17
      range:
        start: 18
        end: 35
      empty: false
- description: anonymous block with forward slash
  input: |-
    BEGIN
        CALL DBMS_OUTPUT.PUT_LINE('Test');
    END;
    /
  result:
    - text: |-
        BEGIN
            CALL DBMS_OUTPUT.PUT_LINE('Test');
        END;
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 3
        column: 5
      range:
        start: 0
        end: 49
      empty: false
- description: ALTER TABLE with PARTITION
  input: |-
    ALTER TABLE DATA.TEST
    MODIFY PARTITION BY RANGE (TXN_DATE)
    INTERVAL (NUMTODSINTERVAL(1, 'DAY'))
    (
    	PARTITION TEST_PO VALUES LESS THAN (
    		TO_DATE('2000-01-01 00:00:00', 'SYYYY-MM-DD HH24:MI:SS', 'NLS_CALENDAR=GREGORIAN')
    	)
    )
    ONLINE;
  result:
    - text: |-
        ALTER TABLE DATA.TEST
        MODIFY PARTITION BY RANGE (TXN_DATE)
        INTERVAL (NUMTODSINTERVAL(1, 'DAY'))
        (
        	PARTITION TEST_PO VALUES LESS THAN (
        		TO_DATE('2000-01-01 00:00:00', 'SYYYY-MM-DD HH24:MI:SS', 'NLS_CALENDAR=GREGORIAN')
        	)
        )
        ONLINE
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 9
        column: 7
      range:
        start: 0
        end: 232
      empty: false
- description: CALL procedure
  input: CALL my_procedure()
  result:
    - text: CALL my_procedure()
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 1
        column: 20
      range:
        start: 0
        end: 19
      empty: false
- description: DROP TABLESPACE with CASCADE CONSTRAINTS
  input: DROP TABLESPACE xxx INCLUDING CONTENTS CASCADE CONSTRAINTS
  result:
    - text: DROP TABLESPACE xxx INCLUDING CONTENTS CASCADE CONSTRAINTS
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 1
        column: 59
      range:
        start: 0
        end: 58
      empty: false
- description: DROP TABLESPACE CASCADE alone should error
  input: DROP TABLESPACE xxx CASCADE
  error: "Syntax error at line 1:28 \nrelated text: DROP TABLESPACE xxx CASCADE;"
- description: DROP TABLESPACE then CASCADE should error
  input: DROP TABLESPACE xxx; CASCADE
  error: "Syntax error at line 1:29 \nrelated text: DROP TABLESPACE xxx; CASCADE;"
- description: 'position semantic: leading newlines'
  input: "\n\nSELECT 1 FROM dual"
  result:
    - text: "\n\nSELECT 1 FROM dual"
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 3
        column: 19
      range:
        start: 0
        end: 20
      empty: false
- description: 'position semantic: leading spaces and newlines'
  input: "\n  \n  SELECT 1 FROM dual"
  result:
    - text: "\n  \n  SELECT 1 FROM dual"
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 3
        column: 21
      range:
        start: 0
        end: 24
      empty: false
- description: 'position semantic: multi-statement with leading whitespace'
  input: "SELECT 1 FROM dual;\n\n  SELECT 2 FROM dual"
  result:
    - text: SELECT 1 FROM dual
      baseline: 0
      start:
        line: 1
        column: 1
      end:
        line: 1
        column: 19
      range:
        start: 0
        end: 18
      empty: false
    - text: "\n\n  SELECT 2 FROM dual"
      baseline: 0
      start:
        line: 1
        column: 19
      end:
        line: 3
        column: 21
      range:
        start: 18
        end: 40
      empty: false
