- description: "simple single statement"
  input: "SELECT 1;"
  result:
    - text: "SELECT 1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 10}
      range: {start: 0, end: 9}
      empty: false

- description: "multiple statements on one line"
  input: "SELECT 1; SELECT 2;"
  result:
    - text: "SELECT 1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 10}
      range: {start: 0, end: 9}
      empty: false
    - text: " SELECT 2;"
      baseline: 0
      start: {line: 1, column: 11}
      end: {line: 1, column: 20}
      range: {start: 9, end: 19}
      empty: false

- description: "multiple statements on multiple lines"
  input: "SELECT 1;\nSELECT 2;"
  result:
    - text: "SELECT 1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 1, column: 10}
      range: {start: 0, end: 9}
      empty: false
    - text: "\nSELECT 2;"
      baseline: 0
      start: {line: 2, column: 1}
      end: {line: 2, column: 10}
      range: {start: 9, end: 19}
      empty: false

- description: "multi-line statement"
  input: "SELECT\n  1;"
  result:
    - text: "SELECT\n  1;"
      baseline: 0
      start: {line: 1, column: 1}
      end: {line: 2, column: 5}
      range: {start: 0, end: 11}
      empty: false
